OpenFOAM/freeSurfaceFlows-0F3.0.0/spillway_3p0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inletAir
    {
        type            patch;
        nFaces          4;
        startFace       57237;
    }
    inletWater
    {
        type            patch;
        nFaces          12;
        startFace       57241;
    }
    outlet
    {
        type            patch;
        nFaces          22;
        startFace       57253;
    }
    atmosphere
    {
        type            patch;
        nFaces          70;
        startFace       57275;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          167;
        startFace       57345;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3006;
        startFace       57512;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3006;
        startFace       60518;
    }
    dam
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6608;
        startFace       63524;
    }
)

// ************************************************************************* //
